[
  {
    "id": "hs6y8w",
    "category": "Music",
    "title": "Burna Boy Knows He Is Losing His Grip On His Nigerian Audience",
    "subtitle": "The more important takeaway from all of this however is that Burna Boy is aware of his waning influence in Nigeria. And for all the casual contempt he has expressed towards Nigeria over the years, he seems to be perturbed by this development",
    "author": "Flo",
    "date": "2025-12-10",
    "image": "http://127.0.0.1:49979/assets/images/blog/image_1744966967.jpg",
    "content": "What happens when a conceited celebrity starts to lose his hold on the spotlight? Admittedly, this is a tricky question to answer but Burna Boy offers us some insight. Two days ago, he stirred online controversy when he posted a series of Instagram Story posts effectively undermining the impact of performing well on music charts in Nigeria . Frankly, this phrasing undersells it. The posts find him addressing his peers in a paternalistic tone and trotting out his now-characteristic condescension of all things Nigeria (well, except Fela and whatever else serves to burnish his global reputation as a conscious, Pan-African musician). The first post reads: “Dear artists, Don’t let Twitter polls and “Naija social media fans” deceive you. They won’t fill up any stadium for you in any part of the world.” The second one is more acerbic and finds him hinting at his actual grievances in more detail. He rightly points out that streams from the Nigerian audience bring in about ten times less revenue compared to streams from America and Europe. The post then closes with his characteristic dramatic flair: “Your song being number 1 on any streaming platform in Nigeria is not something to celebrate. Aim higher or do other businesses on the side. I type with love. #NoSignOfWeakness.” Expectedly his comments have generated a conversation on social media, although, this time the intensity of the debate pales in comparison to the aftermath of his previous disparaging rants. Such as in 2023 when just before he dropped I Told Them, he criticized Afrobeats artists—in an interview with Apple Music’s Zane Lowe—for lacking “substance.” The interview enraged fans, critics, and artists alike, who spent months condemning and debating the internal logic of his commentary. The tepid response to his rant this time, however, suggests that fans are desensitized to this type of rhetoric, which is usually an attempt at drumming up a conversation in anticipation of an imminent release. In recent months, Afrobeats artists have increasingly leaned into this strategy to promote their projects.\r\n\r\n\r\nWe saw it with Wizkid, who viciously excoriated Davido in the months leading up to the release of his album. More recently, Ruger courted this type of controversy in anticipation of his now-released BlownBoy RU album, to little success by the way. He engaged in bluster, claiming to have the pen game in the industry and challenging dissenters to a faceoff. When that didn’t yield much attention. He changed course, cranking up the levers as he took shots at Joeboy, who released his album on the same day. If there were any doubts about his motivations, he revealed the game when he was spotted embracing Joeboy and mouthing the words “All na promo”. The more important takeaway from all of this however is that Burna Boy is aware of his waning influence in Nigeria. And for all the casual contempt he has expressed towards Nigeria over the years, he seems to be perturbed by this development. Earlier this year, Culture Custodian published an article that explored Burna Boy’s loss of momentum in Nigeria.\r\n\r\n\r\nDespite the heavy promotional campaign behind his last few singles and the cloud of controversy and constant appearances on blogs, which have kept him atop the public conversation, his songs have struggled to live up to his hectoring reputation on local charts. For context, his last single Update, which came complete with a music video, failed to peak atop the Apple Music Top 100 Nigeria chart, which is the low-hanging fruit as far as commercial success goes in this part of the world. Make no mistake, he’s still one of Afrobeats’ best-performing artists. He continues to rake in about 5 million daily streams on Spotify, which is by all metrics impressive. He’s also set to host a concert at the 80,000 capacity Stade De France on the 18th of April. His draw on the Nigerian market has however diminished. Which is somewhat ironic considering these days he’s trying his hardest to appeal to this market; public appearances at Lagos nightlife spots every other day; songs carefully crafted for Nigerian palettes; as well the slew of controversies he has stirred in the past few months. Faced with foundering prospects, despite his best efforts, Burna Boy appears resentful. And his latest polemic is simply the rambling of yet another petulant celebrity."
  },
  {
    "id": "kl7a45",
    "category": "Music",
    "title": "US senator meets man mistakenly deported to El Salvador",
    "subtitle": "But Salvadoran President Bukele says Kilmar Ábrego García - who is at the centre of a US court battle - will stay in custody.",
    "author": "Flo",
    "date": "2025-12-10",
    "image": "http://127.0.0.1:50139/assets/images/blog/image_1744994678.jpg",
    "content": "A US senator has met a man who Trump administration officials have acknowledged was deported in error from Maryland to a mega-prison in El Salvador.\r\n\r\nMaryland Senator Chris Van Hollen posted photos with Kilmar Ábrego García, as the administration continues to resist his return to the US despite yet another court ruling against the government on Thursday.\r\n\r\nAfter the meeting, which appeared to take place in a hotel, El Salvador's President Nayib Bukele said the detainee would remain in the country's custody.\r\n\r\nThe White House has accused Mr Ábrego García of being a member of the transnational Salvadoran gang MS-13, a designated foreign terrorist organisation, which his lawyer denies.\r\n\r\n\r\nIn a post on his social media site Truth Social the morning after the meeting, Trump said Van Hollen \"looked like a fool yesterday standing in El Salvador begging for attention from the Fake News Media, or anyone\".\r\n\r\nThe visit came amid an escalating showdown between the US president and the courts over the case.\r\n\r\nA federal court on Thursday ruled against the Trump administration in a case that could force officials to testify under oath about the deportation.\r\n\r\nIn a scathing judgement, the 4th Circuit Court of Appeals called the administration's handling of the situation \"shocking\".\r\n\r\n\"The government is asserting a right to stash away residents of this country in foreign prisons without the semblance of due process that is the foundation of our constitutional order,\" wrote conservative Judge Harvie Wilkinson III, one of three judges on the panel.\r\n\r\nThe government \"claims in essence that because it has rid itself of custody that there is nothing that can be done\", Judge Wilkinson wrote.\r\n\r\n\"This should be shocking not only to judges, but to the intuitive sense of liberty that Americans far removed from courthouses still hold dear.\"\r\n\r\nWhy, the judge wrote, should the government \"not make what was wrong, right?\"\r\n\r\nMr Ábrego García's lawyers are suing the US government for sending him to a mega-prison in El Salvador in March, in what the Trump administration has admitted was an error."
  },
  {
    "id": "ha6784",
    "category": "Music",
    "title": "Student used stepmum's gun in Florida campus shooting, police say",
    "subtitle": "The 20-year-old alleged gunman began shooting at around lunchtime near the student union building.",
    "author": "flo",
    "date": "3333-02-12",
    "image": "http://127.0.0.1:50139/assets/images/blog/image_1744995246.jpg",
    "content": "A shotgun was also found at the scene, police said.\r\n\r\nThe suspect was a \"longstanding member\" of the sheriff office's youth advisory council and was engaged in a number of training programmes, Sheriff Walt McNeil said.\r\n\r\n\"So it is not a surprise that he had access to weapons,\" he said.\r\n\r\nDuring a press conference Thursday, Phoenix Ikner was identified as the son of Jessica Ikner, however Florida court documents indicate that the suspect has a different biological mother and was largely raised by his father and stepmother.\r\n\r\nThe suspect is the stepson of a veteran Leon County police officer who is a model employee, said Sheriff McNeil. Jessica Ikner, a school resource officer, kept the gun after the force upgraded its weapons, he said.\r\n\r\nPolice responded to an active shooter call at around midday local time, the university said. An alert was issued warning students and those on campus to \"seek shelter and await further instructions\".\r\n\r\n\"One of my classmates got an alert on her phone and announced it to the rest of the class,\" student Ava Arenado told CBS News Miami.\r\n\r\nAnother student, Blake Leonard, told CBS he initially heard roughly 12 shots fired.\r\n\r\n\"In my head, I thought it was construction at first, until I looked behind me and saw people running from the union towards my direction, and then I heard another 12 or 15 shots go off, so I started running away from there too,\" he said.\r\n\r\nThe FSU student newspaper quoted the suspect commenting on a rally on campus, which spoke out against President Donald Trump's policies and Israel's war in Gaza, among other things.\r\n\r\nFSUNews.com said Mr Ikner, who was registered to vote as a Republican, commented about anti-Trump protesters: \"These people are usually pretty entertaining, usually not for good reasons.\"\r\n\r\nThe quote was removed from the story on Thursday with an editor's note saying the outlet did not wish to amplify the suspect's voice.\r\n\r\nPresident Donald Trump, who said he was briefed on the incident before meeting Italian Prime Minister Giorgia Meloni at the White House, was asked whether he wanted to change gun regulations in light of the shooting.\r\n\r\nHe said he was a \"big advocate\" of the Second Amendment in the US Constitution, which protects gun rights.\r\n\r\n\"I have been since the beginning,\" he said. \"I have protected it. These things are terrible. We will have more to say about it later.\"\r\n\r\nHe called the shooting \"a shame, a horrible thing\".\r\n\r\nFlorida Governor Ron DeSantis said: \"Our prayers are with our FSU family and state law enforcement is actively responding.\"\r\n\r\nThis is not the first shooting at FSU. In 2015, a graduate of the school shot and injured three people at the library before he was fatally shot by police.\r\n\r\nThe father of a girl who was killed in the 2018 mass shooting at Parkland High School in Florida said some of her classmates who were lucky enough to survive that attack were on the campus at FSU during Thursday's assault.\r\n\r\nFred Guttenberg, a gun control advocate, wrote on X: \"Incredibly, some of them were just a part of their 2nd school shooting and some were in the student union today."
  },
  {
    "id": "gs746h",
    "category": "Music",
    "title": "US lays out plans to hit Chinese ships with port fees",
    "subtitle": "The 20-year-old alleged gunman began shooting at around lunchtime near the student union building.",
    "author": "Emmanuel Irabor",
    "date": "2023-05-22",
    "image": "http://127.0.0.1:50139/assets/images/blog/image_1744995538.png",
    "content": "The US has revealed plans to impose port fees on Chinese ships to try to revive shipbuilding in the US and challenge China's dominance of the industry.\r\n\r\nFrom mid-October, Chinese ship owners and operators will be charged $50 per ton of cargo with the fees increasing each year for the next three years.\r\n\r\nThere have been concerns that the measures would further disrupt global trade after US President Donald Trump's raft of tariff policies, but the fee is less severe than originally suggested.\r\n\r\nA spokesperson for the Chinese foreign ministry said the fees will raise prices for American consumers and \"will not revitalise the US shipbuilding industry\".\r\n\r\n\r\nThe US Trade Representative (USTR) said: \"China has largely achieved its dominance goals, severely disadvantaging US companies, workers, and the US economy\".\r\n\r\nFees on Chinese vessel owners and operators of ships built in China will be based on the weight of their cargo, how many containers they carry or the number of vehicles onboard.\r\n\r\nFor affected bulk vessels, the fee will be based on the weight of their cargo, while the charge for container ships will depend on how many containers a vessel is carrying.\r\n\r\nThe $50 per ton of cargo will rise by $30 a ton each year for the next three years. Fees on Chinese-built ships will start at $18 a ton or $120 per container and also rise over the next three years.\r\n\r\nNon-US built ships carrying cars will be charged $150 per vehicle.\r\n\r\nThe fee will be applied once per voyage on affected ships and not more than five times a year.\r\n\r\nThe USTR also decided not to impose fees based on how many Chinese-built ships are in a fleet or based on prospective orders of Chinese ships, as it had originally proposed.\r\n\r\nEmpty vessels that arrive at US ports to carry bulk exports like coal or grain are exempted.\r\n\r\nVessels that move goods between American ports as well as from those ports to Caribbean islands and US territories are also exempted from rules, as are US and Canadian ships that call at ports in the Great Lakes.\r\n\r\nThe fees are much lower than a plan floated in February to charge up to $1.5m (£1.1m) for each American port a Chinese ship visits."
  },
  {
    "id": "hs7568",
    "category": "Music",
    "title": "US lays out plans to hit Chinese ships with port fees",
    "subtitle": "The 20-year-old alleged gunman began shooting at around lunchtime near the student union building.",
    "author": "Anna Irabor",
    "date": "2025-06-13",
    "image": "http://127.0.0.1:50139/assets/images/blog/image_1744995634.jpg",
    "content": "The US has revealed plans to impose port fees on Chinese ships to try to revive shipbuilding in the US and challenge China's dominance of the industry.\r\n\r\nFrom mid-October, Chinese ship owners and operators will be charged $50 per ton of cargo with the fees increasing each year for the next three years.\r\n\r\nThere have been concerns that the measures would further disrupt global trade after US President Donald Trump's raft of tariff policies, but the fee is less severe than originally suggested.\r\n\r\nA spokesperson for the Chinese foreign ministry said the fees will raise prices for American consumers and \"will not revitalise the US shipbuilding industry\".\r\n\r\n\r\nThe US Trade Representative (USTR) said: \"China has largely achieved its dominance goals, severely disadvantaging US companies, workers, and the US economy\".\r\n\r\nFees on Chinese vessel owners and operators of ships built in China will be based on the weight of their cargo, how many containers they carry or the number of vehicles onboard.\r\n\r\nFor affected bulk vessels, the fee will be based on the weight of their cargo, while the charge for container ships will depend on how many containers a vessel is carrying.\r\n\r\nThe $50 per ton of cargo will rise by $30 a ton each year for the next three years. Fees on Chinese-built ships will start at $18 a ton or $120 per container and also rise over the next three years.\r\n\r\nNon-US built ships carrying cars will be charged $150 per vehicle.\r\n\r\nThe fee will be applied once per voyage on affected ships and not more than five times a year.\r\n\r\nThe USTR also decided not to impose fees based on how many Chinese-built ships are in a fleet or based on prospective orders of Chinese ships, as it had originally proposed.\r\n\r\nEmpty vessels that arrive at US ports to carry bulk exports like coal or grain are exempted.\r\n\r\nVessels that move goods between American ports as well as from those ports to Caribbean islands and US territories are also exempted from rules, as are US and Canadian ships that call at ports in the Great Lakes.\r\n\r\nThe fees are much lower than a plan floated in February to charge up to $1.5m (£1.1m) for each American port a Chinese ship visits."
  },
  {
    "id": "gsja78",
    "category": "Films",
    "title": "US lays out plans to hit Chinese ships with port fees",
    "subtitle": "The 20-year-old alleged gunman began shooting at around lunchtime near the student union building.",
    "author": "Michael Irabor",
    "date": "2024-12-10",
    "image": "http://127.0.0.1:50139/assets/images/blog/image_1744995735.png",
    "content": "The US has revealed plans to impose port fees on Chinese ships to try to revive shipbuilding in the US and challenge China's dominance of the industry.\r\n\r\nFrom mid-October, Chinese ship owners and operators will be charged $50 per ton of cargo with the fees increasing each year for the next three years.\r\n\r\nThere have been concerns that the measures would further disrupt global trade after US President Donald Trump's raft of tariff policies, but the fee is less severe than originally suggested.\r\n\r\nA spokesperson for the Chinese foreign ministry said the fees will raise prices for American consumers and \"will not revitalise the US shipbuilding industry\".\r\n\r\n\r\nThe US Trade Representative (USTR) said: \"China has largely achieved its dominance goals, severely disadvantaging US companies, workers, and the US economy\".\r\n\r\nFees on Chinese vessel owners and operators of ships built in China will be based on the weight of their cargo, how many containers they carry or the number of vehicles onboard.\r\n\r\nFor affected bulk vessels, the fee will be based on the weight of their cargo, while the charge for container ships will depend on how many containers a vessel is carrying.\r\n\r\nThe $50 per ton of cargo will rise by $30 a ton each year for the next three years. Fees on Chinese-built ships will start at $18 a ton or $120 per container and also rise over the next three years.\r\n\r\nNon-US built ships carrying cars will be charged $150 per vehicle.\r\n\r\nThe fee will be applied once per voyage on affected ships and not more than five times a year.\r\n\r\nThe USTR also decided not to impose fees based on how many Chinese-built ships are in a fleet or based on prospective orders of Chinese ships, as it had originally proposed.\r\n\r\nEmpty vessels that arrive at US ports to carry bulk exports like coal or grain are exempted.\r\n\r\nVessels that move goods between American ports as well as from those ports to Caribbean islands and US territories are also exempted from rules, as are US and Canadian ships that call at ports in the Great Lakes.\r\n\r\nThe fees are much lower than a plan floated in February to charge up to $1.5m (£1.1m) for each American port a Chinese ship visits."
  },
  {
    "id": "0u84w7",
    "category": "Music",
    "title": "Solo levelling Ranks number 1 anime ",
    "subtitle": "The 20-year-old alleged gunman began shooting at around lunchtime near the student union building.",
    "author": "Flo",
    "date": "2023-12-10",
    "image": "http://127.0.0.1:50139/assets/images/blog/image_1744996394.jpg",
    "content": "The US has revealed plans to impose port fees on Chinese ships to try to revive shipbuilding in the US and challenge China's dominance of the industry.\r\n\r\nFrom mid-October, Chinese ship owners and operators will be charged $50 per ton of cargo with the fees increasing each year for the next three years.\r\n\r\nThere have been concerns that the measures would further disrupt global trade after US President Donald Trump's raft of tariff policies, but the fee is less severe than originally suggested.\r\n\r\nA spokesperson for the Chinese foreign ministry said the fees will raise prices for American consumers and \"will not revitalise the US shipbuilding industry\".\r\n\r\n\r\nThe US Trade Representative (USTR) said: \"China has largely achieved its dominance goals, severely disadvantaging US companies, workers, and the US economy\".\r\n\r\nFees on Chinese vessel owners and operators of ships built in China will be based on the weight of their cargo, how many containers they carry or the number of vehicles onboard.\r\n\r\nFor affected bulk vessels, the fee will be based on the weight of their cargo, while the charge for container ships will depend on how many containers a vessel is carrying.\r\n\r\nThe $50 per ton of cargo will rise by $30 a ton each year for the next three years. Fees on Chinese-built ships will start at $18 a ton or $120 per container and also rise over the next three years.\r\n\r\nNon-US built ships carrying cars will be charged $150 per vehicle.\r\n\r\nThe fee will be applied once per voyage on affected ships and not more than five times a year.\r\n\r\nThe USTR also decided not to impose fees based on how many Chinese-built ships are in a fleet or based on prospective orders of Chinese ships, as it had originally proposed.\r\n\r\nEmpty vessels that arrive at US ports to carry bulk exports like coal or grain are exempted.\r\n\r\nVessels that move goods between American ports as well as from those ports to Caribbean islands and US territories are also exempted from rules, as are US and Canadian ships that call at ports in the Great Lakes.\r\n\r\nThe fees are much lower than a plan floated in February to charge up to $1.5m (£1.1m) for each American port a Chinese ship visits."
  },

  {
    "id": "5gut2et",
    "category": "Music",
    "title": "Skynet goes live In Moscow",
    "subtitle": "The 20-year-old alleged gunman began shooting at around lunchtime near the student union building.",
    "author": "Emmanuel Irabor",
    "date": "2023-12-10",
    "image": "assets/images/blog/image_1745093576.jpg",
    "content": "The US has revealed plans to impose port fees on Chinese ships to try to revive shipbuilding in the US and challenge China's dominance of the industry.\r\n\r\nFrom mid-October, Chinese ship owners and operators will be charged $50 per ton of cargo with the fees increasing each year for the next three years.\r\n\r\nThere have been concerns that the measures would further disrupt global trade after US President Donald Trump's raft of tariff policies, but the fee is less severe than originally suggested.\r\n\r\nA spokesperson for the Chinese foreign ministry said the fees will raise prices for American consumers and \"will not revitalise the US shipbuilding industry\".\r\n\r\n\r\nThe US Trade Representative (USTR) said: \"China has largely achieved its dominance goals, severely disadvantaging US companies, workers, and the US economy\".\r\n\r\nFees on Chinese vessel owners and operators of ships built in China will be based on the weight of their cargo, how many containers they carry or the number of vehicles onboard.\r\n\r\nFor affected bulk vessels, the fee will be based on the weight of their cargo, while the charge for container ships will depend on how many containers a vessel is carrying.\r\n\r\nThe $50 per ton of cargo will rise by $30 a ton each year for the next three years. Fees on Chinese-built ships will start at $18 a ton or $120 per container and also rise over the next three years.\r\n\r\nNon-US built ships carrying cars will be charged $150 per vehicle.\r\n\r\nThe fee will be applied once per voyage on affected ships and not more than five times a year.\r\n\r\nThe USTR also decided not to impose fees based on how many Chinese-built ships are in a fleet or based on prospective orders of Chinese ships, as it had originally proposed.\r\n\r\nEmpty vessels that arrive at US ports to carry bulk exports like coal or grain are exempted.\r\n\r\nVessels that move goods between American ports as well as from those ports to Caribbean islands and US territories are also exempted from rules, as are US and Canadian ships that call at ports in the Great Lakes.\r\n\r\nThe fees are much lower than a plan floated in February to charge up to $1.5m (£1.1m) for each American port a Chinese ship visits."
  }
]